import numpy as np
# H_вип = 11.6 * (Е1 - е0) * B * t // мм/міс
# t - місяці
# B = 1 + 0.134 * Vb - коеф
# Vb = середня швидкість вітру за місяць в (3.1 - 4.7) м/с
# E1 = максимальна пружність водяної пари при заданій температурі, визн. по табл.
# e0 = u * e1/100%, u = середня відносна вологість повітря %. мб

def empiric_evaporation(t = 1, Vb = 4.7, T = 18, u = 75):
    table_pressure = {6: 873.1,
                      7: 1002.6,
                      8: 1073.5,
                      9: 1148.8,
                      10: 1228.7,
                      11: 1313.5,
                      12: 1403.4,
                      13: 1498.7,
                      14: 1599.6,
                      15: 1706.4,
                      16: 1819.4,
                      17: 1939.0,
                      18: 2065.4,
                      19: 2198.9,
                      20: 2340.0,
                      21: 2488.6,
                      22: 2646.0,
                      23: 2811.7,
                      24: 2986.4,
                      25: 3170.6}
    B = 1 + 0.134 * Vb
    E1 = table_pressure.get(T) / 100.0 # 1мб = 100 Па
    e0 = u * E1 / 100.0
    H_eva = 11.6 * (E1 - e0) * B * t
    return H_eva / 1000.0